# I. Topo 1 : VLAN et Routing

Dans cette partie, on va donner un peu de sens aux VLANs :

- un pour les serveurs du r√©seau
  - on simulera √ßa avec un p'tit serveur web
- un pour les admins du r√©seau
- un pour les autres random clients du r√©seau

Cela dit, il faut que tout ce beau monde puisse se ping, au moins joindre le r√©seau des serveurs, pour acc√©der au super site-web.

**Bien que bloqu√© au niveau du switch √† cause des VLANs, le trafic pourra passer d'un VLAN √† l'autre gr√¢ce √† un routeur.**

Il assurera son job de routeur traditionnel : router entre deux r√©seaux. Sauf qu'en plus, il g√©rera le changement de VLAN √† la vol√©e.

## 1. Topologie 1

![Topologie 1](../img/topo1.png)

## 2. Adressage topologie 1

Les r√©seaux et leurs VLANs associ√©s :

| R√©seau    | Adresse        | VLAN associ√© |
| --------- | -------------- | ------------ |
| `clients` | `10.1.10.0/24`  | 10           |
| `admins`  | `10.1.20.0/24` | 20           |
| `servers` | `10.1.30.0/24` | 30           |

L'adresse des machines au sein de ces r√©seaux :

| Node               | `clients`       | `admins`         | `servers`        |
| ------------------ | --------------- | ---------------- | ---------------- |
| `pc1.clients.tp4`  | `10.1.10.1/24`   | x                | x                |
| `pc2.clients.tp4`  | `10.1.10.2/24`   | x                | x                |
| `adm1.admins.tp4`  | x               | `10.1.20.1/24`   | x                |
| `web1.servers.tp4` | x               | x                | `10.1.30.1/24`   |
| `r1`               | `10.1.10.254/24` | `10.1.20.254/24` | `10.1.30.254/24` |

## 3. Setup topologie 1

üñ•Ô∏è VM `web1.servers.tp4`, d√©roulez la [Checklist VM Linux](#checklist-vm-linux) dessus

üåû **Adressage**

- d√©finissez les IPs statiques sur toutes les machines **sauf le *routeur***

```
PC1> ip 10.1.10.1
Checking for duplicate address...
PC1 : 10.1.10.1 255.255.255.0

PC2> ip 10.1.10.2
Checking for duplicate address...
PC2 : 10.1.10.2 255.255.255.0

adm1> ip 10.1.20.1
Checking for duplicate address...
adm1 : 10.1.20.1 255.255.255.0

[root@localhost ~]# ip a
$1: lo: <LOOPBACK,UP,LOWER_UP> mtu 65536 qdisc noqueue state UNKNOWN group default qlen 1000
    link/loopback 00:00:00:00:00:00 brd 00:00:00:00:00:00
    inet 127.0.0.1/8 scope host lo
       valid_lft forever preferred_lft forever
    inet6 ::1/128 scope host
       valid_lft forever preferred_lft forever
2: enp0s3: <BROADCAST,MULTICAST,UP,LOWER_UP> mtu 1500 qdisc fq_codel state UP group default qlen 1000
    link/ether 08:00:27:71:e2:92 brd ff:ff:ff:ff:ff:ff
    inet 10.1.30.1/24 brd 10.1.30.255 scope global noprefixroute enp0s3
       valid_lft forever preferred_lft forever
    inet6 fe80::a00:27ff:fe71:e292/64 scope link
       valid_lft forever preferred_lft forever
```


üåû **Configuration des VLANs**

- r√©f√©rez-vous au [m√©mo Cisco](../../../../cours/memo/memo_cisco.md)
- d√©claration des VLANs sur le switch `sw1`
- ajout des ports du switches dans le bon VLAN (voir [le tableau d'adressage de la topo 2 juste au dessus](#2-adressage-topologie-2))
- il faudra ajouter le port qui pointe vers le *routeur* comme un *trunk* : c'est un port entre deux √©quipements r√©seau (un *switch* et un *routeur*)
```
sw1#show vlan br

VLAN Name                             Status    Ports
---- -------------------------------- --------- -------------------------------
1    default                          active    Et1/0, Et1/1, Et1/2, Et1/3
                                                Et2/0, Et2/1, Et2/2, Et2/3
                                                Et3/0, Et3/1, Et3/2, Et3/3
10   clients                          active    Et0/0, Et0/1
20   admins                           active    Et0/2
30   servers                          active    Et0/3

```
---

‚ûú **Pour le *routeur***

- r√©f√©rez-vous au [m√©mo Cisco](../../../../cours/memo/memo_cisco.md)
- ici, on va avoir besoin d'un truc tr√®s courant pour un *routeur* : qu'il porte plusieurs IP sur une unique interface
  - avec Cisco, on cr√©e des "sous-interfaces" sur une interface
  - et on attribue une IP √† chacune de ces sous-interfaces
- en plus de √ßa, il faudra l'informer que, pour chaque interface, elle doit √™tre dans un VLAN sp√©cifique

Pour ce faire, un exemple. On attribue deux IPs `192.168.1.254/24` VLAN 10 et `192.168.2.254` VLAN20 √† un *routeur*. L'interface concern√©e sur le *routeur* est `fastEthernet 0/0` :

```cisco
# conf t

(config)# interface fastEthernet 0/0.10
R1(config-subif)# encapsulation dot1Q 10
R1(config-subif)# ip addr 192.168.1.254 255.255.255.0 
R1(config-subif)# exit

(config)# interface fastEthernet 0/0.20
R1(config-subif)# encapsulation dot1Q 20
R1(config-subif)# ip addr 192.168.2.254 255.255.255.0 
R1(config-subif)# exit
```

üåû **Config du *routeur***

- attribuez ses IPs au *routeur*
  - 3 sous-interfaces, chacune avec son IP et un VLAN associ√©

```
R1#show ip interface brief
Interface                  IP-Address      OK? Method Status                Protocol
FastEthernet0/0            unassigned      YES unset  administratively down down
FastEthernet0/0.10         10.1.10.254     YES manual administratively down down
FastEthernet0/0.20         10.1.20.254     YES manual administratively down down
FastEthernet0/0.30         10.1.30.254     YES manual administratively down down
[...]
```

üåû **V√©rif**

- tout le monde doit pouvoir ping le routeur sur l'IP qui est dans son r√©seau
- en ajoutant une route vers les r√©seaux, ils peuvent se ping entre eux
  - ajoutez une route par d√©faut sur les VPCS
  - ajoutez une route par d√©faut sur la machine virtuelle
  - testez des `ping` entre les r√©seaux



interface Ethernet0/0
switchport mode access
switchport access vlan 10
exit
interface Ethernet0/1
switchport mode access
switchport access vlan 10
exit
interface Ethernet0/2
switchport mode access
switchport access vlan 20
exit
interface Ethernet0/3
switchport mode access
switchport access vlan 30
exit
switchport trunk allowed vlan add 10,20,30